module.ecs_service.data.aws_iam_policy_document.task_assume_role: Reading...
module.ecs_service.aws_cloudwatch_log_group.ecs_logs: Refreshing state... [id=/ecs/hello-birthday-api-service]
module.ecs_cluster.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:cluster/cerepx-dev-cluster]
module.api_gateway.aws_apigatewayv2_api.api: Refreshing state... [id=fin2rd81o1]
module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-029a6cd1da94ed29e]
module.vpc.aws_iam_role.flow_logs_role: Refreshing state... [id=vpc-flow-logs-role]
module.rds.aws_kms_key.rds_performance_insights: Refreshing state... [id=c7a90af2-b80a-47f5-817d-76ef08929a64]
module.vpc.aws_kms_key.vpc_flow_logs: Refreshing state... [id=347137e7-8489-4dd5-8ff0-561bac764438]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.aws_iam_role.task_role: Refreshing state... [id=hello-birthday-api-service-task]
module.ecs_service.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=hello-birthday-api-service-exec]
module.api_gateway.aws_apigatewayv2_stage.default_stage: Refreshing state... [id=$default]
module.ecs_service.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=hello-birthday-api-service-exec-20250428162643346700000002]
module.vpc.aws_iam_role_policy.flow_logs_policy: Refreshing state... [id=vpc-flow-logs-role:vpc-flow-logs-policy]
module.vpc.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flowlogs/hello-birthday-dev]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b360bbebcaa480e5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0116a9ef8764923a8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4f96a4a08eb4a5b]
module.vpc.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-021526ee9aacb5835]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-01c87601e22172550]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddb2b3fdf159574c]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-076af04a71628d30b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ca998b2f809f036c]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0622864b918d283ed]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07832cfb87db1c4c3]
module.vpc.aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f0309c1f8f7d983e]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-0ae81af3f721e51a4]
module.vpc.aws_route.default_internet_access: Refreshing state... [id=r-rtb-0b360bbebcaa480e51080289494]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-061f4a5976790ac17]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08047ccfb754ab73d]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=hello-birthday-dev-subnet-group]
module.vpc.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-00fcf997fa737e3ff]
module.vpc.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-0c74164063fcc63f1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f88590ccfac5c504]
module.api_gateway.aws_apigatewayv2_vpc_link.api_vpc_link: Refreshing state... [id=ef4cpb]
module.vpc.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0a52f66d478624684]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bc26398f249d5dad]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-000b959cb9c8c17b6]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/985cc60b534ada89]
module.rds.aws_db_instance.this: Refreshing state... [id=db-MNYKAUQQ3O3OCCMOP5A35SVKSM]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=hello-birthday-api-service]
module.ecs_service.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service]
module.api_gateway.aws_apigatewayv2_integration.alb_integration: Refreshing state... [id=ycj81b2]
module.api_gateway.aws_apigatewayv2_route.default_route: Refreshing state... [id=77el2at]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs_service.aws_ecs_service.this has been deleted
  - resource "aws_ecs_service" "this" {
      - id                                 = "arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service" -> null
      - name                               = "hello-birthday-api-service" -> null
        tags                               = {}
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "cerepx-dev-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "hello-birthday-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "hello-birthday-api"
          + container_port   = 5050
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ae81af3f721e51a4",
            ]
          + subnets          = [
              + "subnet-0ca998b2f809f036c",
              + "subnet-0ddb2b3fdf159574c",
            ]
        }
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential        = true
                  ~ image            = "456212641044.dkr.ecr.eu-west-1.amazonaws.com/hello-birthday-api:1.0.30" -> "456212641044.dkr.ecr.eu-west-1.amazonaws.com/hello-birthday-api:1.0.33"
                  - mountPoints      = []
                    name             = "hello-birthday-api"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "hello-birthday-api-service" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Commentterraform-plan -->